index_tasks = {
    "tasks": [
        {"task": "Задание 6",
         "description": """Создать страницу, на которой будет форма для ввода имени
         и возраста пользователя и кнопка "Отправить"
         При нажатии на кнопку будет произведена проверка
         возраста и переход на страницу с результатом или на
         страницу с ошибкой в случае некорректного возраста.
         """},
        {"task": "Задание 7",
         "description": """Создать страницу, на которой будет форма для ввода числа
         и кнопка "Отправить"
         При нажатии на кнопку будет произведено
         перенаправление на страницу с результатом, где будет
         выведено введенное число и его квадрат.
         """},
        {"task": "Задание 8",
         "description": """Создать страницу, на которой будет форма для ввода имени
         и кнопка "Отправить"
         При нажатии на кнопку будет произведено
         перенаправление на страницу с flash сообщением, где будет
         выведено "Привет, {имя}!".
         """},
        {"task": "Задание 9",
         "description": """Создать страницу, на которой будет форма для ввода имени
            и электронной почты
            При отправке которой будет создан cookie файл с данными
            пользователя
            Также будет произведено перенаправление на страницу
            приветствия, где будет отображаться имя пользователя.
            На странице приветствия должна быть кнопка "Выйти"
            При нажатии на кнопку будет удален cookie файл с данными
            пользователя и произведено перенаправление на страницу
            ввода имени и электронной почты.
        """},
    ],
}

flash_text = {
    "title": "Задание 8",
    "name": """Создать страницу, на которой будет форма для ввода имени
         и кнопка "Отправить"
         При нажатии на кнопку будет произведено
         перенаправление на страницу с flash сообщением, где будет
         выведено "Привет, {имя}!".
         """,
    "enter_name": "Введите ваше имя",

}

contacts_text = {
    "title": "Контакты",
    "github": "https://github.com/BRATnavsegda",
}

name_age_content = {
    "title": "Необходимо указать имя пользователя и возраст",
    "name": """Создать страницу, на которой будет форма для ввода имени
         и возраста пользователя и кнопка "Отправить"
         При нажатии на кнопку будет произведена проверка
         возраста и переход на страницу с результатом или на
         страницу с ошибкой в случае некорректного возраста.
         """,

}

cor_age = {
    "title": "Поздравляем вам больше 18 лет",
    "categories": [
        {"name": "Вернуться на главную страницу",
         "link": "/"},
    ]
}

err_age = {
    "title": "Вам меньше 18 лет",
    "categories": [
        {"name": "Вернуться на главную страницу",
         "link": "/"},
    ]
}

num_square = {
    "title": "Введите число",
    "name": """Создать страницу, на которой будет форма для ввода числа
         и кнопка "Отправить"
         При нажатии на кнопку будет произведено
         перенаправление на страницу с результатом, где будет
         выведено введенное число и его квадрат.
         """,

}

auth = {
    "title": "Нужно авторизоваться",
    "name": """Создать страницу, на которой будет форма для ввода имени
            и электронной почты
            При отправке которой будет создан cookie файл с данными
            пользователя
            Также будет произведено перенаправление на страницу
            приветствия, где будет отображаться имя пользователя.
            На странице приветствия должна быть кнопка "Выйти"
            При нажатии на кнопку будет удален cookie файл с данными
            пользователя и произведено перенаправление на страницу
            ввода имени и электронной почты.
        """,
    "enter_name": "Николай",
    "enter_email": "Nikolai777@yandex.ru",
}


